; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 72)
	(= (value c1) 18)
	(= (value c2) 28)
	(= (value c3) 59)
	(= (value c4) 85)
	(= (value c5) 80)
	(= (value c6) 51)
	(= (value c7) 44)
	(= (value c8) 4)
	(= (value c9) 62)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 9
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 9
3. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 9
4. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 9
5. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 9
6. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 9
7. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 4 of 9
8. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 9
9. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 4 of 9
10. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 4 of 9
11. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 4 of 9
12. (decrement_rate c7)
   changed: (rate_value c7) from 1 to 0
   goals met: 4 of 9
13. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 9
14. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 9
15. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 9
16. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 9
17. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 9
18. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 9
19. (increment c5)
   changed: (value c5) from 80 to 83
   goals met: 4 of 9
20. (increment c5)
   changed: (value c5) from 83 to 86
   goals met: 5 of 9
21. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 9
22. (decrement c6)
   changed: (value c6) from 51 to 47
   goals met: 5 of 9
23. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 5 of 9
24. (decrement c6)
   changed: (value c6) from 47 to 43
   goals met: 6 of 9
25. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 9
26. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 6 of 9
27. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 6 of 9
28. (increment c8)
   changed: (value c8) from 4 to 11
   goals met: 6 of 9
29. (increment c8)
   changed: (value c8) from 11 to 18
   goals met: 6 of 9
30. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 9
31. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 9
32. (increment c8)
   changed: (value c8) from 18 to 25
   goals met: 6 of 9
33. (increment c8)
   changed: (value c8) from 25 to 32
   goals met: 6 of 9
34. (increment c8)
   changed: (value c8) from 32 to 39
   goals met: 6 of 9
35. (increment c8)
   changed: (value c8) from 39 to 46
   goals met: 7 of 9
36. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 9
37. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 9
38. (increment c1)
   changed: (value c1) from 18 to 26
   goals met: 7 of 9
39. (increment c1)
   changed: (value c1) from 26 to 34
   goals met: 6 of 9
40. (increment c1)
   changed: (value c1) from 34 to 42
   goals met: 6 of 9
41. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 6 of 9
42. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 6 of 9
43. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 6 of 9
44. (decrement c1)
   changed: (value c1) from 42 to 34
   goals met: 6 of 9
45. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 9
46. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 9
47. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 6 of 9
48. (increment c6)
   changed: (value c6) from 43 to 50
   goals met: 5 of 9
49. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 5 of 9
50. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 5 of 9
51. (increment c6)
   changed: (value c6) from 50 to 59
   goals met: 5 of 9
52. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 5 of 9
53. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 5 of 9
54. (increment c7)
   changed: (value c7) from 44 to 47
   goals met: 4 of 9
55. (increment c8)
   changed: (value c8) from 46 to 53
   goals met: 5 of 9
56. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 5 of 9
57. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 5 of 9
58. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 5 of 9
59. (increment c1)
   changed: (value c1) from 34 to 44
   goals met: 5 of 9
60. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 5 of 9
61. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 5 of 9
62. (decrement c1)
   changed: (value c1) from 44 to 34
   goals met: 5 of 9
63. (decrement c0)
   changed: (value c0) from 72 to 66
   goals met: 5 of 9
64. (decrement c1)
   changed: (value c1) from 34 to 24
   goals met: 6 of 9
65. (decrement c0)
   changed: (value c0) from 66 to 60
   goals met: 6 of 9
66. (decrement c0)
   changed: (value c0) from 60 to 54
   goals met: 6 of 9
67. (increment c1)
   changed: (value c1) from 24 to 34
   goals met: 5 of 9
68. (decrement c0)
   changed: (value c0) from 54 to 48
   goals met: 5 of 9
69. (decrement c1)
   changed: (value c1) from 34 to 24
   goals met: 6 of 9
70. (decrement c0)
   changed: (value c0) from 48 to 42
   goals met: 6 of 9
71. (decrement c0)
   changed: (value c0) from 42 to 36
   goals met: 6 of 9
72. (increment c1)
   changed: (value c1) from 24 to 34
   goals met: 5 of 9
73. (decrement c0)
   changed: (value c0) from 36 to 30
   goals met: 6 of 9
74. (decrement c1)
   changed: (value c1) from 34 to 24
   goals met: 6 of 9
75. (decrement c0)
   changed: (value c0) from 30 to 24
   goals met: 6 of 9
76. (decrement c0)
   changed: (value c0) from 24 to 18
   goals met: 7 of 9
77. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 9
78. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 9
79. (increment c7)
   changed: (value c7) from 47 to 50
   goals met: 7 of 9
80. (decrement c6)
   changed: (value c6) from 59 to 49
   goals met: 8 of 9
81. (decrement c5)
   changed: (value c5) from 86 to 80
   goals met: 7 of 9
82. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 9
83. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 9
84. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 9
85. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 9
86. (decrement c5)
   changed: (value c5) from 80 to 70
   goals met: 7 of 9
87. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 9
88. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 9
89. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 9
90. (increment c5)
   changed: (value c5) from 70 to 80
   goals met: 7 of 9
91. (decrement c4)
   changed: (value c4) from 85 to 82
   goals met: 7 of 9
92. (decrement c4)
   changed: (value c4) from 82 to 79
   goals met: 8 of 9
93. (decrement c5)
   changed: (value c5) from 80 to 70
   goals met: 7 of 9
94. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 7 of 9
95. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 9
96. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 9
97. (decrement c4)
   changed: (value c4) from 79 to 74
   goals met: 7 of 9
98. (decrement c4)
   changed: (value c4) from 74 to 69
   goals met: 7 of 9
99. (decrement c4)
   changed: (value c4) from 69 to 64
   goals met: 7 of 9
100. (decrement c4)
   changed: (value c4) from 64 to 59
   goals met: 7 of 9
101. (decrement c5)
   changed: (value c5) from 60 to 50
   goals met: 6 of 9
102. (decrement c4)
   changed: (value c4) from 59 to 54
   goals met: 6 of 9
103. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 9
104. (increment c5)
   changed: (value c5) from 50 to 60
   goals met: 7 of 9
105. (increment c4)
   changed: (value c4) from 54 to 59
   goals met: 7 of 9
106. (decrement c3)
   changed: (value c3) from 59 to 58
   goals met: 8 of 9
107. (increment c6)
   changed: (value c6) from 49 to 59
   goals met: 7 of 9
108. (increment c6)
   changed: (value c6) from 59 to 69
   goals met: 8 of 9
109. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 8 of 9
110. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 8 of 9
111. (increment c7)
   changed: (value c7) from 50 to 55
   goals met: 7 of 9
112. (increment c7)
   changed: (value c7) from 55 to 60
   goals met: 7 of 9
113. (increment c7)
   changed: (value c7) from 60 to 65
   goals met: 7 of 9
114. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 9
115. (increment c7)
   changed: (value c7) from 65 to 70
   goals met: 8 of 9
116. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 8 of 9
117. (increment c8)
   changed: (value c8) from 53 to 62
   goals met: 7 of 9
118. (increment c8)
   changed: (value c8) from 62 to 71
   goals met: 8 of 9
119. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 8 of 9
120. (decrement c8)
   changed: (value c8) from 71 to 61
   goals met: 8 of 9
121. (decrement c7)
   changed: (value c7) from 70 to 65
   goals met: 7 of 9
122. (decrement c7)
   changed: (value c7) from 65 to 60
   goals met: 8 of 9
123. (decrement c6)
   changed: (value c6) from 69 to 59
   goals met: 8 of 9
124. (decrement c5)
   changed: (value c5) from 60 to 50
   goals met: 8 of 9
125. (decrement c4)
   changed: (value c4) from 59 to 54
   goals met: 7 of 9
126. (decrement c4)
   changed: (value c4) from 54 to 49
   goals met: 8 of 9
127. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 9
128. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 9
129. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 9
130. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 9
131. (decrement c3)
   changed: (value c3) from 58 to 53
   goals met: 8 of 9
132. (decrement c3)
   changed: (value c3) from 53 to 48
   goals met: 9 of 9
